# Scale

## Description
Procedure Scale rescales selected objects. Scaling occurs about the center of the selected object(s).

```pascal
PROCEDURE Scale(
				scaleXR : REAL;
				scaleYR : REAL);
```

```python
def vs.Scale(scaleXR, scaleYR):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|scaleXR|REAL|X scale factor.|
|scaleYR|REAL|Y scale factor.|

## Remarks
See also HScale2D.

## Examples
#### VectorScript ####
```pascal
Scale(2,3);
```
#### Python ####
```python

```

```pascal
Scale(1.0, 2.0);
```
```python
vs.Scale(scaleXR, scaleYR)
```

## Version
Availability: from All Versions

## Category
* General Edit